app/views/todo_lists/show.html.erb

SELECT "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND (completed_at is not null)  [["todo_list_id", 3]]
---
    <ul>
      <% @todo_list.todo_items.incomplete.each do |todo_item| %>