app/controllers/password_resets_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "lol@lol.lol"]]
---
  def create
    user = User.find_by(email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."password_reset_token" = ? LIMIT 1  [["password_reset_token", "tEiWk_ZpUxb7cZ2ySJ6IZq4p7mQJiNrpINhzpWiqf9sDQMmBc0PSIM8AokB_XUs3"]]
---
  def edit
    @user = User.find_by(password_reset_token: params[:id])