app/controllers/todo_items_controller.rb

INSERT INTO "todo_items" ("content", "todo_list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "2222222"], ["todo_list_id", 6], ["created_at", "2015-05-24 19:37:00.178001"], ["updated_at", "2015-05-24 19:37:00.178001"]]
---
  def create
    @todo_item = @todo_list.todo_items.new(todo_item_params)
    if @todo_item.save

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 5], ["id", 4]]
---
  def edit
    @todo_item = @todo_list.todo_items.find(params[:id])

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 6], ["id", 12]]
UPDATE "todo_items" SET "completed_at" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["completed_at", "2015-05-24 19:37:07.891784"], ["updated_at", "2015-05-24 19:37:07.893159"], ["id", 12]]
---
  def complete
    @todo_item = @todo_list.todo_items.find(params[:id])
    @todo_item.update_attribute(:completed_at, Time.now)

SELECT  "todo_items".* FROM "todo_items" WHERE "todo_items"."todo_list_id" = ? AND "todo_items"."id" = ? LIMIT 1  [["todo_list_id", 5], ["id", 4]]
UPDATE "todo_items" SET "content" = ?, "updated_at" = ? WHERE "todo_items"."id" = ?  [["content", "Confirm passwd"], ["updated_at", "2015-05-23 12:08:45.147161"], ["id", 4]]
---
  def update
    @todo_item = @todo_list.todo_items.find(params[:id])
    if @todo_item.update_attributes(todo_item_params)

SELECT  "todo_lists".* FROM "todo_lists" WHERE "todo_lists"."user_id" = ? AND "todo_lists"."id" = ? LIMIT 1  [["user_id", 5], ["id", 6]]
---
  def find_todo_list
    @todo_list = current_user.todo_lists.find(params[:todo_list_id])